# Imports

In [28]:
import pandas as pd
import numpy as np
import csv

# From CSV/Txt

In regular python:

In [4]:
with open('./data/btc-market-price-checkpoint.csv', 'r') as fp:
    for index, line in enumerate(fp.readlines()):
        if (index<6):
            print(line)

2017-04-02 00:00:00,1099.169125

2017-04-03 00:00:00,1141.813

2017-04-04 00:00:00,1141.6003625

2017-04-05 00:00:00,1133.0793142857142

2017-04-06 00:00:00,1196.3079375

2017-04-07 00:00:00,1190.45425

With pandas:

In [7]:
df = pd.read_csv('./data/btc-market-price-checkpoint.csv')

df.head()

   2017-04-02 00:00:00  1099.169125
0  2017-04-03 00:00:00  1141.813000
1  2017-04-04 00:00:00  1141.600363
2  2017-04-05 00:00:00  1133.079314
3  2017-04-06 00:00:00  1196.307937
4  2017-04-07 00:00:00  1190.454250

# From a database

Opening DB and creating the engine

In [79]:
from sqlalchemy import create_engine, text

# Database credentials
user = 'root'
password = '011011011'  # Make sure to handle passwords securely
host = 'localhost'
port = '3306'
database = 'Chinook'

# Create the SQLAlchemy engine
engine_url = f"mysql+pymysql://{user}:{password}@{host}:{port}/{database}"
engine = create_engine(engine_url)

        
# Print the results
pd.read_sql('SHOW TABLES;', engine)

   Tables_in_Chinook
0              Album
1             Artist
2           Customer
3           Employee
4              Genre
5            Invoice
6        InvoiceLine
7          MediaType
8           Playlist
9      PlaylistTrack
10             Track

In [113]:
df = pd.read_sql(
    '''
    # SELECT * FROM Album
    # SELECT * FROM Track
    
    # SELECT a.AlbumId, a.Title, COUNT(*) AS total_Songs
    # FROM Track t INNER JOIN Album a ON t.AlbumId = a.AlbumId 
    # GROUP BY a.AlbumId;
    
    SELECT *
    FROM Track t INNER JOIN Album a ON t.AlbumId = a.AlbumId;
    '''
    , engine
)

df[df['Composer'].isnull()].head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice,AlbumId,Title,ArtistId
62,63,Desafinado,8,1,2,None,185338,5990473,0.99,8,Warner 25 Anos,6
63,64,Garota De Ipanema,8,1,2,None,285048,9348428,0.99,8,Warner 25 Anos,6
64,65,Samba De Uma Nota Só (One Note Samba),8,1,2,None,137273,4535401,0.99,8,Warner 25 Anos,6
65,66,Por Causa De Você,8,1,2,None,169900,5536496,0.99,8,Warner 25 Anos,6
66,67,Ligia,8,1,2,None,251977,8226934,0.99,8,Warner 25 Anos,6

In [72]:
df.isnull().sum()

TrackId           0
Name              0
AlbumId           0
MediaTypeId       0
GenreId           0
Composer        977
Milliseconds      0
Bytes             0
UnitPrice         0
dtype: int64

In [73]:
df['Composer'] = df['Composer'].fillna('Unknown')

In [77]:
df.duplicated().sum()

0

In [ ]:
conn.close()